import { Question, QuestionType } from '@/types/common.type';

export const selfYoungQuestions: Question[] = [
  {
    id: '1',
    question: 'เพื่อน ๆ ของคุณเล่นการพนันบ่อย ๆ หรือเล่นด้วยเงินจํานวนมาก',
  },
  {
    id: '2',
    question: 'คุณเคยเล่นการพนันที่โรงเรียน',
  },
  {
    id: '3',
    question: 'คุณเคยขาดเรียนหรือไม่ยอมไปทํางานเพื่อจะไปเล่นการพนัน',
  },
  {
    id: '4',
    question: 'การเล่นพนันมีความสําคัญมากกว่าการไปโรงเรียนหรือไปทําางาน',
  },
  {
    id: '5',
    question:
      'บ่อยครั้งที่คุณใช้เวลาว่างไปกับกิจกรรมการพนัน เช่น เล่นไพ่พนัน พนันทายผลกีฬา ฯลฯ',
  },
  {
    id: '6',
    question:
      'คุณพบว่า สําหรับคุณแล้ว การพนันเป็นกิจกรรมอันน่าตื่นเต้นอย่างยิ่ง',
  },
  {
    id: '7',
    question:
      'ตอนที่คุณเล่นพนัน คุณมักจะเล่นจนไม่สนใจเวลาและหลงลืมสิ่งอื่น ๆ ไปเลย',
  },
  {
    id: '8',
    question: 'บ่อยครั้งที่คุณใช้เวลาไปกับการคิดฝันถึงการพนัน',
  },
  {
    id: '9',
    question:
      'คุณรู้สึกว่าเพื่อน ๆ อิจฉาคุณเมื่อคุณชนะพนัน และการพนันทําให้คุณเป็นคนพิเศษ',
  },
  {
    id: '10',
    question:
      'เมื่อคุณชนะพนัน คุณจะกลับไปเล่นพนันต่อ เพราะคุณเชื่อว่าจะชนะพนันอีก',
  },
  {
    id: '11',
    question:
      'เมื่อคุณเสียพนัน คุณมีความรู้สึกว่าจะต้องรีบกลับไปแก้มือ เพื่อให้ได้เงินที่เสียไปคืนมา',
  },
  {
    id: '12',
    question:
      'บ่อยครั้งที่คุณนําเงินที่ตั้งใจจะเอาไปซ้ืออย่างอ่ืนไปใช้เล่นการพนัน',
  },
  {
    id: '13',
    question: 'คุณเคยยืมเงินคนอื่นไปเล่นการพนัน',
  },
  {
    id: '14',
    question:
      'คุณเคยขายสิ่งของที่ชอบหรือของที่สำคัญสำหรับคุณ เพื่อนำไปเล่นการพนันหรือจ่ายหนี้พนัน',
  },
  {
    id: '15',
    question:
      'คุณพยายามปกปิดครอบครัวและเพื่อน ว่าคุณเล่นพนันมากแค่ไหนและบ่อยแค่ไหน',
  },
  {
    id: '16',
    question:
      'คุณเคยโกหกเกี่ยวกับการเล่นพนันของคุณ เช่น โกหกว่าไม่ได้เล่นพนัน หรือ เล่นเสียแต่บอกว่าเล่นได้',
  },
  {
    id: '17',
    question: 'คุณเคยมีปากเสียงกับคนในครอบครัวหรือเพื่อนด้วยเรื่องการเล่นพนัน',
  },
  {
    id: '18',
    question: 'คุณเคยรู้สึกผิด หดหู่ใจ หรือนอนไม่หลับ เพราะคุณเสียพนัน',
  },
  {
    id: '19',
    question: 'คุณเคยคิดจะฆ่าตัวตายเพื่อหนีปัญหา',
  },
  {
    id: '20',
    question:
      'ผู้ปกครองหรือผู้ใหญ่ในครอบครัวของคุณเล่นพนันบ่อย ๆ หรือเล่นด้วยเงินจําานวนมาก',
  },
];

export const familyQuestions: Question[] = [
  {
    id: '1',
    question:
      'คุณรู้สึกเบื่อหน่ายหรือรําคาญใจอยู่บ่อย ๆ ที่มีคนมาตามทวงหนี้พนันกับครอบครัวคุณ',
  },
  {
    id: '2',
    question:
      'คนในครอบครัวของคุณที่เล่นพนันคนนั้นมักจะหายออกจากบ้านไปนาน ๆ โดยที่อธิบายไม่ได้',
  },
  {
    id: '3',
    question: 'คนที่เล่นพนันคนนั้นเคยเอาเวลาทํางานไปใช้เล่นพนัน',
  },
  {
    id: '4',
    question:
      'คุณรู้สึกว่าคนท่ีเล่นพนันคนนั้นไม่น่าไว้วางใจเกี่ยวกับเรื่องเงิน ๆ ทอง ๆ',
  },
  {
    id: '5',
    question:
      'คนที่เล่นพนันคนนั้นเคยสัญญาหรือสาบานว่าจะเลิกเล่นพนัน แต่ก็กลับไปเล่นการพนันอีกเป็นอย่างนี้มาหลายครั้งแล้ว',
  },
  {
    id: '6',
    question:
      'คนที่เล่นพนันคนน้ันเคยเล่นพนันนานกว่าที่ควรจะเล่น จนกระทั่งไม่เหลือเงินติดตัว',
  },
  {
    id: '7',
    question:
      'คนที่เล่นพนันคนนั้นมักจะกลับไปเล่นพนันทันทีที่มีโอกาส โดยหวังว่าจะได้เงินที่เสียไปคืนมาหรือชนะพนันมากกว่าเดิม',
  },
  {
    id: '8',
    question:
      'คนที่เล่นพนันคนนั้นเคยเล่นพนันเพื่อให้ได้เงินมาใช้แก้ไขปัญหาทางการเงิน หรือมีความคาดหวังลม ๆ แล้ง ๆ ว่าการพนันจะนําาพาครอบครัวไปสู่ความสะดวกสบายและความรํา่ารวย',
  },
  {
    id: '9',
    question:
      'คนที่เล่นพนันคนนั้นเคยยืมเงินคนอื่นมาใช้เล่นพนัน หรือเพ่ือนําไปใช้หนี้พนัน',
  },
  {
    id: '10',
    question:
      'คนที่เล่นพนันคนนั้นเคยเสียภาพลักษณ์หรือดูแย่ในสายตาคนอื่นจากพฤติกรรมการเล่นพนัน หรือเคยทําเรื่องผิดกฎหมายเพื่อหาเงินไปใช้กับการพนัน',
  },
  {
    id: '11',
    question:
      'คุณเคยต้องซ่อนเงินที่เป็นค่าใช้จ่ายจําาเป็นของครอบครัวจากคนที่เล่นพนันคนนั้น เพราะรู้ว่า ถ้าไม่ทําเช่นนั้น คุณและสมาชิกในครอบครัวอาจจะไม่มีเงินใช้',
  },
  {
    id: '12',
    question:
      'เมื่อมีโอกาส คุณจะค้นเสื้อผ้าหรือเปิดดูกระเป๋าสตางค์ของคนที่เล่นพนันคนนั้น หรือตรวจสอบว่าไปทําอะไรมาบ้าง',
  },
  {
    id: '13',
    question:
      'คนที่เล่นพนันคนนั้นซ่อนเงินของตัวเองเอาไว้โดยไม่ให้คนในครอบครัวรู้',
  },
  {
    id: '14',
    question:
      'คุณสังเกตว่า คนท่ีเล่นพนันคนนั้นมีบุคลิกภาพเปลี่ยนแปลงไปเมื่อได้เล่นการพนันมากขึ้น',
  },
  {
    id: '15',
    question:
      'คนที่เล่นพนันคนนั้นมักจะสร้างเรื่องโกหกเพ่ือกลบเกลื่อนหรือเพื่อปฏิเสธว่าไปเล่นการพนันมา',
  },
  {
    id: '16',
    question:
      'คนที่เล่นพนันคนนั้นเคยกล่าวโทษคุณ หรือทําให้คุณรู้สึกว่ามีส่วนทําาให้เขาต้องไปเล่นการพนัน',
  },
  {
    id: '17',
    question:
      'คุณเคยต้องพยายามคาดเดาอารมณ์ของคนที่เล่นพนันคนนั้น หรือคอยจัดการบางอย่างในชีวิตแทนคน ๆ นั้น',
  },
  {
    id: '18',
    question:
      'คนที่เล่นพนันคนนั้นเคยทุกข์ใจจากความรู้สึกผิด หรือมีอาการซึมเศร้าจากพฤติกรรม การเล่นพนันของตัวเองจนบางครั้งถึงขั้นอยากหายไปจากโลกนี้',
  },
  {
    id: '19',
    question: 'การพนันเคยทําให้คุณเสี่ยงที่จะเกิดปัญหาครอบครัวแตกแยก',
  },
  {
    id: '20',
    question:
      'คุณเคยรู้สึกว่า ชีวิตของคุณที่ต้องมาอยู่ร่วมกับคนที่เล่นพนันคนน้ันเป็นเหมือนกับฝันร้าย',
  },
];

export const selfOldQuestions: Question[] = [
  {
    id: '1',
    question: 'คุณเคยเอาเวลาจากการทํางานหรือการเรียนไปใช้เล่นการพนัน',
  },
  {
    id: '2',
    question: 'การพนันเคยทําให้ชีวิตครอบครัวของคุณไม่มีความสุข',
  },
  {
    id: '3',
    question:
      'การเล่นพนันของคุณส่งผลเสียต่อภาพลักษณ์ หรือทําให้คุณดูแย่ในสายตาคนอื่น',
  },
  {
    id: '4',
    question: 'คุณเคยรู้สึกผิด ละอายใจหลังจากท่ีเล่นการพนัน',
  },
  {
    id: '5',
    question: 'คุณเคยเล่นการพนันเพื่อหาเงินไปใช้หนี้ หรือแก้ปัญหาทางการเงิน',
  },
  {
    id: '6',
    question: 'การพนันทําให้ความมุ่งมั่นและศักยภาพในตัวคุณลดลง',
  },
  {
    id: '7',
    question:
      'เมื่อคุณเสียพนัน คุณมีความรู้สึกว่าจะต้องรีบกลับไปแก้มือ เพื่อให้ได้เงินที่เสียไปคืนมา',
  },
  {
    id: '8',
    question:
      'เมื่อคุณชนะพนัน คุณมีความต้องการอย่างมากที่จะกลับไปเล่นต่อ เพื่อชนะพนันอีกเรื่อยๆ',
  },
  {
    id: '9',
    question: 'บ่อยครั้งที่คุณเล่นพนันจนไม่เหลือเงินติดตัวสักบาท',
  },
  {
    id: '10',
    question: 'คุณเคยยืมเงินคนอื่นมาใช้เล่นพนัน',
  },
  {
    id: '11',
    question: 'คุณเคยนําสิ่งของไปขาย เพื่อนําเงินมาใช้เล่นพนัน',
  },
  {
    id: '12',
    question:
      'คุณรู้สึกลังเลหรือลําบากใจที่จะนํา “เงินที่ใช้เล่นพนัน” ไปใช้สอยอย่างอื่น',
  },
  {
    id: '13',
    question: 'การพนันทําาให้คุณละเลย ไม่เอาใจใส่ตัวเองหรือคนในครอบครัว',
  },
  {
    id: '14',
    question: 'คุณเคยเล่นพนันนานเกินกว่าท่ีตั้งใจไว้',
  },
  {
    id: '15',
    question:
      'คุณเคยเล่นพนันเพื่อหลีกหนีปัญหา เล่นให้ลืมเร่ืองที่กังวล เล่นแก้เบ่ือ หรือเล่นเพื่อคลายเหงา',
  },
  {
    id: '16',
    question: 'คุณเคยคิดจะทําเรื่องผิดกฎหมายเพื่อหาเงินมาใช้เล่นพนัน',
  },
  {
    id: '17',
    question: 'การพนันทําให้คุณนอนหลับยากขึ้น',
  },
  {
    id: '18',
    question:
      'เวลามีปัญหากับคนอ่ืน มีเรื่องผิดหวัง หรือขุ่นข้องหมองใจ คุณจะรู้สึกต้องการไปเล่นพนัน',
  },
  {
    id: '19',
    question:
      'เวลามีเรื่องน่ายินดีเข้ามาในชีวิต คุณจะอยากฉลองด้วยการเล่นพนันสักสองสามชั่วโมง',
  },
  {
    id: '20',
    question:
      'คุณเคยคิดว่าอยากจะหายไปจากโลกนี้หรือคิดจะฆ่าตัวตายเพื่อหนีปัญหาที่เกิดจากการพนัน',
  },
];

export const questionsPool: Record<
  QuestionType,
  {
    question: Question[];
    redirectLink: string;
  }
> = {
  'self-old': {
    question: selfOldQuestions,
    redirectLink: '/question/self/old',
  },
  'self-young': {
    question: selfYoungQuestions,
    redirectLink: '/question/self/young',
  },
  family: {
    question: familyQuestions,
    redirectLink: '/question/family',
  },
};
